```

=== CONT  TestAccorkstationsWorkstationCluster_update
    provider_test.go:315: Step 1/5 error: After applying this test step and performing a `terraform refresh`, the plan was not empty.
        stdout
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          + create
        -/+ destroy and then create replacement
        
        Terraform will perform the following actions:
        
          # google_compute_subnetwork.default will be created
          + resource "google_compute_subnetwork" "default" {
              + creation_timestamp         = (known after apply)
              + external_ipv6_prefix       = (known after apply)
              + fingerprint                = (known after apply)
              + gateway_address            = (known after apply)
              + id                         = (known after apply)
              + ip_cidr_range              = "10.0.0.0/24"
              + ipv6_cidr_range            = (known after apply)
              + name                       = "tf-test-workstation-clusterkowd4p0wlv"
              + network                    = "tf-test-workstation-clusterkowd4p0wlv"
              + private_ip_google_access   = (known after apply)
              + private_ipv6_google_access = (known after apply)
              + project                    = (known after apply)
              + purpose                    = (known after apply)
              + region                     = "us-central1"
              + secondary_ip_range         = (known after apply)
              + self_link                  = (known after apply)
              + stack_type                 = (known after apply)
            }
        
          # google_workstations_workstation_cluster.default must be replaced
        -/+ resource "google_workstations_workstation_cluster" "default" {
              ~ conditions             = [
                  - {
                      - code    = 5
                      - details = []
                      - message = "reconcile endpoint: create: googleapi: Error 404: The resource 'projects/xxxxx/regions/us-central1/subnetworks/tf-test-workstation-clusterkowd4p0wlv' was not found, notFound"
                    },
                ] -> (known after apply)
              ~ create_time            = "2023-01-17T21:13:48.595856163Z" -> (known after apply)
              ~ degraded               = true -> (known after apply)
              ~ etag                   = "ppY12CyH_l0nqhdqArmVtt135q5kqhXPumcwT0Dk-ms" -> (known after apply)
              ~ id                     = "projects/xxxxxx/locations/us-central1/workstationClusters/tf-test-workstation-clusterkowd4p0wlv" -> (known after apply)
              ~ name                   = "projects/xxxxxx/locations/us-central1/workstationClusters/tf-test-workstation-clusterkowd4p0wlv" -> (known after apply)
              ~ project                = "xxxxxx" -> (known after apply)
              - reconciling            = false -> null
              ~ subnetwork             = "projects/xxxxxx/regions/us-central1/subnetworks/tf-test-workstation-clusterkowd4p0wlv" -> (known after apply) # forces replacement
              ~ uid                    = "eb16edb0-d400-4e1e-ae3d-4bb30d9fa911" -> (known after apply)
                # (5 unchanged attributes hidden)
            }
        
        Plan: 2 to add, 0 to change, 1 to destroy.
--- FAIL: TestAccorkstationsWorkstationCluster_update (3009.73s)
FAIL
FAIL	github.com/hashicorp/terraform-provider-google-beta/google-beta	3009.768s
FAIL
```